src/conf/DataProcessors/уп_ГрафикПроцедур.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<DataProcessor>
		<Properties>
			<Name>уп_ГрафикПроцедур</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Процедуры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВремяНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Клиент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Помещение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Помещения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Процедура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Процедуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипЗаполнения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.уп_СостоянияГрафика</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/conf/InformationRegisters/уп_ГрафикРаботы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<InformationRegister>
		<Properties>
			<Name>уп_ГрафикРаботы</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Процедура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Процедуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_СостоянияГрафика</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Помещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Помещения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВремяНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/conf/Enums/уп_СостоянияГрафика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<Enum>
		<Properties>
			<Name>уп_СостоянияГрафика</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Ручной</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Автоматический</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыт</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/conf/Catalogs/Организации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<Catalog>
		<Properties>
			<Name>Организации</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>БИК</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГлавныйБухгалтер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Директор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИндивидуальныйПредприниматель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнформационноеОбслуживание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорреспондентскийСчет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеСокращенное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОГРН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Префикс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетныйСчет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГоловнаяОрганизация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Календари</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДляСписка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДействуетС</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/conf/DataProcessors/уп_ГрафикПроцедур/Forms/Форма/Ext/Form/Module.bsl
#Область Предопределенные

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.Организация = Справочники.Организации.ОрганизацияПоУмолчанию();
	Если Справочники.Организации.КоличествоОрганизаций() = 1 Тогда
		Элементы.Организация.Видимость = Ложь;   
	КонецЕсли;	
	
	НачалоПериода = НачалоНедели(ТекущаяДата());
	КонецПериода = НачалоПериода + 6*24*60*60; 	
	
	СоздатьКолонкиПоПомещениям();
	ЗаполнитьТаблицуГрафика();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПоказатьПериод(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	Если Не ЗавершениеРаботы Тогда
		ОбновитьДанныеВРегистре();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	//Вставить содержимое обработчика
КонецПроцедуры

#КонецОбласти

#Область Служебные
&НаСервере
Процедура ЗаполнитьТаблицуГрафика() 	
	ЗаполнитьСтрокиПоГрафику();  	
	ЗаполнитьДаннымиСРегистра();
КонецПроцедуры

&НаСервере
Процедура СоздатьКолонкиПоПомещениям()
	СписокПомещений = Справочники.Помещения.ПолучитьСписокАктивныхПомещений();
	МассивРеквизитов = Новый Массив;
	
	КС = Новый КвалификаторыСтроки(250);
	Массив = Новый Массив;
	Массив.Добавить(Тип("Строка"));
	ОписаниеТиповС = Новый ОписаниеТипов(Массив, , КС);

	Для Каждого Помещение Из СписокПомещений Цикл
		РеквизитФормы = Новый РеквизитФормы("к"+Помещение.Код, ОписаниеТиповС, "График", Помещение.Наименование);
		МассивРеквизитов.Добавить(РеквизитФормы);
		
		НС = ПомещениеИКод.Добавить();
		НС.Помещение = Помещение.Ссылка;
		НС.Код = Помещение.Код;
	КонецЦикла;
	ИзменитьРеквизиты(МассивРеквизитов);
	
	Для Каждого Помещение Из СписокПомещений Цикл 
      Элемент = Элементы.Добавить("к"+Помещение.Код, Тип("ПолеФормы"), Элементы.График); 
      Элемент.Вид = ВидПоляФормы.ПолеВвода;
      Элемент.ПутьКДанным = "График." + "к"+Помещение.Код;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтрокиПоГрафику()
	МассивГрафиков = Новый Массив;
	МассивГрафиков.Добавить(Объект.Организация.ГрафикРаботы);
	ДниРаботы = ГрафикиРаботы.РасписанияРаботыНаПериод(МассивГрафиков, НачалоПериода, КонецПериода);
	ДниРаботы.Сортировать("ДатаГрафика, ВремяНачала");
	ТекущийДень = Дата("00010101");
	//График.Очистить();
	МаксимальнаяГраница = График.Количество()-1;
	Счетчик = 0;
	Для Каждого Строка Из ДниРаботы Цикл
		Если Строка.ДатаГрафика <> ТекущийДень Тогда
			Если Счетчик > МаксимальнаяГраница Тогда
				НС = График.Добавить();
			Иначе
				НС = График[Счетчик];
			КонецЕсли;
			Счетчик = Счетчик + 1;
			НС.Время = Формат(Строка.ДатаГрафика, "ДФ='d MMMM, dddd'");
			ТекущийДень = Строка.ДатаГрафика;
		КонецЕсли;
		Если Счетчик > МаксимальнаяГраница Тогда
			НС = График.Добавить();
		Иначе
			НС = График[Счетчик];
		КонецЕсли;
		Счетчик = Счетчик + 1;
		НС.Время = "" + Формат(Строка.ВремяНачала, "ДФ=ЧЧ:мм") + " - " + Формат(Строка.ВремяОкончания, "ДФ=ЧЧ:мм");
		НС.ВремяСкр = Дата(Год(Строка.ДатаГрафика), Месяц(Строка.ДатаГрафика), День(Строка.ДатаГрафика), Час(Строка.ВремяНачала), Минута(СТрока.ВремяНачала), Секунда(Строка.ВремяНачала));
	КонецЦикла;
	Пока Счетчик < МаксимальнаяГраница Цикл
		График.Удалить(Счетчик);
		Счетчик = Счетчик + 1;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеВРегистре()
	
	ДеньПериода = НачалоПериода;
	Пока ДеньПериода <= КонецПериода Цикл
		НаборЗаписей = РегистрыСведений.уп_ГрафикРаботы.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Период.Значение = ДеньПериода;
		НаборЗаписей.Отбор.Период.Использование = Истина;
		НаборЗаписей.Прочитать();
		НаборЗаписей.Очистить();
		НаборЗаписей.Записать(Истина);
		ДеньПериода = ДеньПериода + 24*60*60;
	КонецЦикла;
	
	НаборЗаписей.Отбор.Период.Использование = Ложь;
	Для Каждого Строка Из Объект.Процедуры Цикл
		НС = НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(НС, Строка);
		НС.Период = Строка.ВремяНачала;
		НС.ВремяОкончания = Строка.ВремяНачала + Строка.Процедура.Длительность*60;
		НС.Состояние = Строка.ТипЗаполнения;
	КонецЦикла;
	НаборЗаписей.Записать(Истина);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьГрафикФормы()
	Для Каждого Строка Из График Цикл
		Для Каждого Помещение из ПомещениеИКод Цикл
			Строка["к"+Помещение.Код] = "";
		КонецЦикла;
	КонецЦикла;
	
	ПараметрыОтбора = Новый Структура;
	Для Каждого СтрокаДанных Из Объект.Процедуры Цикл
		ПараметрыОтбора.Вставить("ВремяСкр", СтрокаДанных.ВремяНачала);
		НайденныеСтроки = График.НайтиСтроки(ПараметрыОтбора);
		Для Каждого СтрокаГрафика Из НайденныеСтроки Цикл
			СтрокаГрафика["к"+СтрокаДанных.Помещение.Код] = "" + ?(ЗначениеЗаполнено(СтрокаГрафика["к"+СтрокаДанных.Помещение.Код]),СтрокаГрафика["к"+СтрокаДанных.Помещение.Код] + Символы.ПС, "")
				+ СтрокаДанных.Сотрудник + " / " + СтрокаДанных.Клиент + " / " + СтрокаДанных.Процедура;
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДаннымиСРегистра()
	Объект.Процедуры.Загрузить(РегистрыСведений.уп_ГрафикРаботы.ПолучитьДанныеЗаПериод(НачалоПериода, КонецДня(КонецПериода)));
	ЗаполнитьГрафикФормы();
КонецПроцедуры

&НаКлиенте
Функция ПолучитьСписокПроцедур(ПараметрыСписка)
	СписокПроцедур = Новый Массив;
	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("ВремяНачала", ПараметрыСписка.ВремяНачала);
	СтруктураПоиска.Вставить("Помещение", ПараметрыСписка.Помещение);
	Массив = Объект.Процедуры.НайтиСтроки(СтруктураПоиска);
	Для Каждого СтрокаПоиска Из Массив Цикл
		СписокПроцедур.Добавить(Новый Структура ("Помещение, Сотрудник, Клиент, Процедура", СтрокаПоиска.Помещение, СтрокаПоиска.Сотрудник, СтрокаПоиска.Клиент, СтрокаПоиска.Процедура));
	КонецЦикла;
	
	Возврат СписокПроцедур;
КонецФункции

&НаКлиенте
Функция ПолучитьПомещениеПоКоду(Код)
	СтрПоиска = Новый Структура("Код", Сред(Код, 2));
	МассивПомещений = ПомещениеИКод.НайтиСтроки(СтрПоиска);
	Если МассивПомещений.Количество() > 0 Тогда
		Пом = МассивПомещений[0].Помещение;
	Иначе
		Пом = Неопределено;
	КонецЕсли;
	Возврат Пом;
КонецФункции

&НаКлиенте
Процедура ГрафикВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;

	
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("КодПомещения", Сред(Поле.Имя, 2));
	ПараметрыФормы.Вставить("ВремяНачала", Элемент.ТекущиеДанные.ВремяСкр);
	ПараметрыФормы.Вставить("Помещение", ПолучитьПомещениеПоКоду(Поле.Имя));
	
	
	ПараметрыФормы.Вставить("Список", ПолучитьСписокПроцедур(ПараметрыФормы));
	
	
	ОткрытьФорму("Обработка.уп_ГрафикПроцедур.Форма.ФормаЭлемента", ПараметрыФормы, ЭтотОбъект);
КонецПроцедуры

&НаСервере
Процедура ПереместитьПроцедуру (ВремяС, ПомещениеС, ВремяНа, ПомещениеНа)
	СтрПоиска = Новый Структура;
	СтрПоиска.Вставить("ВремяНачала", ВремяС);
	СтрПоиска.Вставить("Помещение", ПомещениеС);
	МассивПоиска = Объект.Процедуры.НайтиСтроки(СтрПоиска);
	Для Каждого Строка Из МассивПоиска Цикл
		Строка.ВремяНачала = ВремяНа;
		Строка.Помещение = ПомещениеНа;
	КонецЦикла;
	
	ОбновитьДанныеВРегистре();
	ЗаполнитьТаблицуГрафика();
КонецПроцедуры

&НаСервере
Процедура ОбновитьГрафик(МассивДанных)
	СтрПоиска = Новый Структура;
	Для Каждого Строка Из МассивДанных Цикл
		СтрПоиска.Вставить("ВремяНачала", Строка.ВремяНачала);
		СтрПоиска.Вставить("Помещение", Строка.Помещение);
		НайденныеСтроки = Объект.Процедуры.НайтиСтроки(СтрПоиска);
		Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			Объект.Процедуры.Удалить(НайденнаяСтрока);
		КонецЦикла;
	КонецЦикла;
	
	Для Каждого Строка Из МассивДанных Цикл
		НС = Объект.Процедуры.Добавить();
		ЗаполнитьЗначенияСвойств(НС, Строка, "ВремяНачала, Процедура, Помещение, Сотрудник, Клиент");
		НС.ТипЗаполнения = Перечисления.уп_СостоянияГрафика.Ручной;
	КонецЦикла;
	
	ОбновитьДанныеВРегистре();
	ЗаполнитьТаблицуГрафика();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	Если ВРег(ИсточникВыбора.ИмяФормы) = ВРег("Обработка.уп_ГрафикПроцедур.Форма.ФормаЭлемента") Тогда
		Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
			ОбновитьГрафик(ВыбранноеЗначение.Расписание);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Удалить(Команда)
	СтрПоиска = Новый Структура;
	СтрПоиска.Вставить("ВремяНачала", Элементы.График.ТекущиеДанные.ВремяСкр);
	СтрПоиска.Вставить("Помещение", ПолучитьПомещениеПоКоду(Элементы.График.ТекущийЭлемент.Имя));
	МассивДанных = Объект.Процедуры.НайтиСтроки(СтрПоиска);
	Для Каждого Элемент Из МассивДанных Цикл
		Объект.Процедуры.Удалить(Элемент);
	КонецЦикла;

	ОбновитьДанныеВРегистре();
	ЗаполнитьТаблицуГрафика();
КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
	ОбновитьДанныеВРегистре();
КонецПроцедуры

// Процедура управляет показом в форме периода построения отчета.
//
&НаКлиентеНаСервереБезКонтекста
Процедура ПоказатьПериод(Форма)
	Форма.мНадписьПериод = ПредставлениеПериода(НачалоДня(Форма.НачалоПериода), КонецДня(Форма.КонецПериода), "ФП = Истина" );
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ИзменитьПериод(Форма, Шаг)
	
	Форма.НачалоПериода  = НачалоДня(Форма.НачалоПериода) + Шаг * 60*60*24*7; 
	Форма.КонецПериода = НачалоДня(Форма.НачалоПериода) + 60*60*24*6;
		
	ПоказатьПериод(Форма);
КонецПроцедуры // ИзменитьПериод()


&НаКлиенте
Процедура УстановитьПредыдущийПериод(Команда)
	ИзменитьПериод(ЭтаФорма, -1);
	ЗаполнитьТаблицуГрафика();
КонецПроцедуры


&НаКлиенте                                                                                       

Процедура УстановитьСледующийПериод(Команда)
	ИзменитьПериод(ЭтаФорма, 1);
	ЗаполнитьТаблицуГрафика();
КонецПроцедуры


&НаКлиенте
Процедура ГрафикНачалоПеретаскивания(Элемент, ПараметрыПеретаскивания, Выполнение)
	мКодКолонкиПеретаскивания = Элемент.ТекущийЭлемент.Имя;
	мВремяПеретаскивания = Элемент.ТекущиеДанные.ВремяСкр;
	Выполнение = Истина;
КонецПроцедуры                                                                               


&НаКлиенте
Процедура ГрафикОкончаниеПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
//	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры


&НаКлиенте
Процедура ГрафикПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	// Вставить содержимое обработчика.
	СтандартнаяОбработка = ложь;
	ПереместитьПроцедуру(мВремяПеретаскивания, ПолучитьПомещениеПоКоду(мКодКолонкиПеретаскивания), График.НайтиПоИдентификатору(Строка).ВремяСкр, ПолучитьПомещениеПоКоду(Поле.Имя));
КонецПроцедуры


&НаКлиенте
Процедура ГрафикПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	// Вставить содержимое обработчика.             
	Если Не ЗначениеЗаполнено(График.НайтиПоИдентификатору(Строка).ВремяСкр) ИЛИ (Поле.Имя = "ГрафикВремя") Тогда
		ПараметрыПеретаскивания.Действие = ДействиеПеретаскивания.Отмена;
	Иначе
		ПараметрыПеретаскивания.Действие = ДействиеПеретаскивания.Перемещение;
	КонецЕсли;
КонецПроцедуры
#КонецОбласти
